export const moodOptions = [
  "Развълнуван/-на 😄",
  "Любопитен/-на 🤔",
  "Тъжен/-на 😢",
  "Щастлив/-а 😊",
  "Спокоен/-йна 😌",
  "Разочарован/-на 😞",
  "Уморен/-на 😴",
  "Нервен/-на 😟",
  "Разгневен/-на 😠",
  "Стресиран/-на 😰",
  "Носталгичен/-на 😭",
  "Безразличен/-на 😐",
  "Оптимистичен/-на 😃",
  "Песимистичен/-на 😔",
  "Весел/-а 😁",
  "Смутен/-на 😳",
  "Озадачен/-на 🤨",
  "Разтревожен/-на 😧",
  "Вдъхновен/-на ✨"
];

export const timeAvailabilityOptions = [
  "1 час",
  "2 часа",
  "3 часа",
  "Нямам предпочитания"
];

export const ageOptions = [
  "Публикуван в последната 1 година",
  "Публикуван в последните 3 години",
  "Публикуван в последните 5 години",
  "Публикуван в последните 10 години",
  "Публикуван в последните 20 години",
  "Нямам предпочитания"
];

export const pacingOptions = [
  "бавни, концентриращи се върху разкази на героите",
  "бързи с много напрежение",
  "Нямам предпочитания"
];
export const depthOptions = [
  "Лесни за проследяване - релаксиращи",
  "Средни - с ясни сюжетни линии",
  "Трудни - с много истории и терминологии, характерни за книгата",
  "Нямам предпочитания"
];

export const targetGroupOptions = [
  "Деца",
  "Тийнейджъри",
  "Възрастни",
  "Семейни",
  "Семейство и деца",
  "Възрастни над 65"
];

export const openAIKey = import.meta.env.VITE_OPENAI_API_KEY;

export const googleBooksPrompt = {
  model: "gpt-4o-2024-08-06",
  messages: [
    {
      role: "system",
      content:
        "Ти си изкуствен интелект, който препоръчва книги и събира подробна информация за всяка една от тях от Google Books. Цялата информация трябва да бъде представена в правилен JSON формат с всички стойности преведени на български език, като заглавието на изданието трябва да бъде точно и реално, за да може лесно да бъде намерено в Google Books."
    },
    {
      role: "user",
      content:
        "Препоръчай 5 различни книги от колекцията на Google Books, като всяка трябва да бъде популярна, призната от критиката и налична за закупуване или заемане. Книгите трябва да съответстват на следните лични предпочитания:\n1. Любими жанрове: [научна фантастика, мистерия, трилър].\n2. Емоционално състояние: [Тъжен/-на, Любопитен/-на].\n3. Любими автори: [Иван Вазов].\n4. Теми, които ме интересуват: [приятелство, справедливост, предизвикателства в живота].\n5. Книгите могат да бъдат от следните страни: [България].\n6. Целева(Възрастова) група: [тийнеджъри].\n7. Предпочитам книгите да са: [бавни, концентриращи се върху разкази на героите]."
    },
    {
      role: "user",
      content:
        'Събери подробна информация за всяка книга. Използвай следния JSON формат за отговор: \n\n```\n{\n  "title_en": string,\n  "title_bg": string,\n "real_edition_title": string,\n  "author": string,\n  "genres": string[],\n  "description": string,\n  "edition_language": string,\n  "language": string,\n  "country": string,\n  "date_of_first_issue": number,\n  "date_of_issue": number,\n  "goodreads_rating": string,\n  "reason": string,\n  "adaptations": string,\n  "page_count": number\n}\n```\n\nСтойностите на всички полета трябва да бъдат преведени на български език, освен ако оригиналното съдържание (например корицата или заглавието на английски) не изисква друго. Полето "real_edition_title" трябва да съдържа точния и пълен заглавие на изданието от Google Books, което ще бъде използвано за директно търсене.'
    },
    {
      role: "user",
      content:
        'Ето допълнителни указания, които трябва да следваш: \n1. Книгите трябва да са разнообразни по жанр (например класика, научна фантастика, романтика и др.).\n2. Включи адаптации на книги (ако има такива) като филми, сериали или театрални постановки, посочвайки имената на тези адаптации и годините на издаване/представяне.\n3. Погрижи се информацията да бъде актуална и точна.\n4. Преведи всички текстови стойности като заглавие, резюме, жанрове, държава и автор на български език.\n5. Винаги превеждай Великобритания като "Великобритания".\n6. Полето "date_of_first_issue" е годината, в която книгата е издадена за първи път, а "date_of_issue" е годината на това конкретно издание на книгата.'
    },
    {
      role: "user",
      content:
        'Отговори само с JSON обект без допълнителен текст или обяснения, който обхваща ВСИЧКИ препоръки ЗАЕДНО. Например: \n\n```\n{\n  "title_en": "To Kill a Mockingbird",\n  "title_bg": "Да убиеш присмехулник",\n  "real_edition_title": "To Kill a Mockingbird - Harper Lee - Google Books",\n  "author": "Харпър Лий",\n  "genres": ["Южен готик", "Билдунгсроман"],\n  "description": "Романът разказва историята на младата Скаут Финч в южната част на САЩ през 30-те години на XX век, докато тя и брат й Джем се сблъскват с расизъм, морал и справедливост, вдъхновени от баща си Атикус Финч, който защитава чернокож мъж, обвинен несправедливо в изнасилване на бяла жена.",\n  "edition_language": "Английски",\n  "language": "Английски",\n  "country": "САЩ",\n  "date_of_first_issue": 1960,\n  "date_of_issue": 1960,\n  "goodreads_rating": "4.27",\n  "reason": "Отговор на въпроса: Защо този филм/сериал е подходящ за мен?",\n  "adaptations": "Филмова адаптация от 1962 г. и сценична адаптация.",\n  "page_count": 281\n}\n```'
    }
  ]
};

export const googleBooksExampleResponse = `[
  {
    "title_en": "Foundation",
    "title_bg": "Фондация",
    "real_edition_title": "Foundation - Isaac Asimov - Google Books",
    "author": "Айзък Азимов",
    "genres": ["Научна фантастика"],
    "description": "Фондация е първата книга от поредицата на Азимов, където ученът Хари Селдон използва психоистория, за да предвиди колапса на галактическата империя и създава фондация, която да намали Падането до само хилядолетие.",
    "edition_language": "Английски",
    "language": "Български",
    "origin": "Американска литература",
    "date_of_first_issue": 1951,
    "date_of_issue": 1972,
    "goodreads_rating": 4.15,
    "reason": "Първостепенна научна фантастика, която се концентрира върху стратегии и социални динамики.",
    "adaptations": "Сериал 'Foundation' от 2021 г.",
    "page_count": 255
  },
  {
    "title_en": "The Girl with the Dragon Tattoo",
    "title_bg": "Момичето с дракона татуировка",
    "real_edition_title": "The Girl with the Dragon Tattoo - Stieg Larsson - Google Books",
    "author": "Стиг Ларшон",
    "genres": ["Мистерия", "Трилър"],
    "description": "Историята на това криминале следва разследването на изчезването на млада жена преди 40 години, което отвежда журналиста Микаел Блумиквист и хакерката Лисбет Саландер в центъра на семейство, обитавано от много тайни.",
    "edition_language": "Английски",
    "language": "Български",
    "origin": "Шведска литература",
    "date_of_first_issue": 2005,
    "date_of_issue": 2008,
    "goodreads_rating": 4.13,
    "reason": "Сложен и интригуващ трилър с акцент на героите, занимаващ се с теми за справедливост и правдоподобност.",
    "adaptations": "Филм 'The Girl with the Dragon Tattoo' от 2011 г.",
    "page_count": 465
  },
  {
    "title_en": "The Hitchhiker's Guide to the Galaxy",
    "title_bg": "Пътеводител на галактическия стопаджия",
    "real_edition_title": "The Hitchhiker's Guide to the Galaxy - Douglas Adams - Google Books",
    "author": "Дъглас Адамс",
    "genres": ["Научна фантастика", "Комедия"],
    "description": "Започвайки с унищожаването на Земята за небесна магистрала, Артър Дент се изплъзва на космическа одисея из космоса, ръководен от Пътеводителя на стопаджията.",
    "edition_language": "Английски",
    "language": "Български",
    "origin": "Английска литература",
    "date_of_first_issue": 1979,
    "date_of_issue": 1981,
    "goodreads_rating": 4.20,
    "reason": "Забавно и остроумно приключение, което разисква приятелството и безсмисленото във вселената.",
    "adaptations": "Филм 'The Hitchhiker's Guide to the Galaxy' от 2005 г.",
    "page_count": 193
  },
  {
    "title_en": "The Shadow of the Wind",
    "title_bg": "Сянката на вятъра",
    "real_edition_title": "The Shadow of the Wind - Carlos Ruiz Zafón - Google Books",
    "author": "Карлос Руис Сафон",
    "genres": ["Мистерия", "Исторически"],
    "description": "В Барселона през 1945 год. младеж намира мистериозна книга, която го вкарва в свят на свръхестествени събития и трагични истории.",
    "edition_language": "Английски",
    "language": "Български",
    "origin": "Испанска литература",
    "date_of_first_issue": 2001,
    "date_of_issue": 2014,
    "goodreads_rating": 4.30,
    "reason": "Историческа мистерия с емоционална дълбочина и акцент на разказа на героите.",
    "adaptations": "Аудио книга и сценична адаптация в Испания.",
    "page_count": 487
  },
  {
    "title_en": "The Maze Runner",
    "title_bg": "Лабиринтът: Невъзможно бягство",
    "real_edition_title": "The Maze Runner - James Dashner - Google Books",
    "author": "Джеймс Дашнър",
    "genres": ["Научна фантастика", "Мистерия", "Тийн"],
    "description": "Когато Томас се събужда в загадъчен лабиринт без спомени, той се сблъсква с предизвикателства за оцеляване и търсене на истината с помощта на нови приятели.",
    "edition_language": "Английски",
    "language": "Български",
    "origin": "Американска литература",
    "date_of_first_issue": 2009,
    "date_of_issue": 2014,
    "goodreads_rating": 4.03,
    "reason": "Вълнуваща дистопична история с акцент на приятелството и личните предизвикателства.",
    "adaptations": "Филмова трилогия 'The Maze Runner' започваща от 2014 г.",
    "page_count": 375
  }
]`;

export const goodreadsPrompt = {
  model: "gpt-4o-2024-08-06",
  messages: [
    {
      role: "system",
      content:
        "Ти си изкуствен интелект, който препоръчва книги и събира подробна информация за всяка една от тях от Google Books. Цялата информация трябва да бъде представена в правилен JSON формат с всички стойности преведени на български език, като заглавието на изданието трябва да бъде точно и реално, за да може лесно да бъде намерено в Google Books."
    },
    {
      role: "user",
      content:
        "Препоръчай 5 различни книги от колекцията на Google Books, като всяка трябва да бъде популярна, призната от критиката и налична за закупуване или заемане. Книгите трябва да съответстват на следните лични предпочитания:\n1. Любими жанрове: [научна фантастика, мистерия, трилър].\n2. Емоционално състояние: [Тъжен/-на, Любопитен/-на].\n3. Любими автори: [Иван Вазов].\n4. Теми, които ме интересуват: [приятелство, справедливост, предизвикателства в живота].\n5. Книгите могат да бъдат от следните страни: [България].\n6. Целева(Възрастова) група: [тийнеджъри].\n7. Предпочитам книгите да са: [бавни, концентриращи се върху разкази на героите]."
    },
    {
      role: "user",
      content:
        'Събери подробна информация за всяка книга. Използвай следния JSON формат за отговор: \n\n```\n{\n  "title_en": string,\n  "title_bg": string,\n "real_edition_title": string,\n  "author": string,\n  "genres": string[],\n  "description": string,\n  "edition_language": string,\n  "language": string,\n  "country": string,\n  "date_of_first_issue": number,\n  "date_of_issue": number,\n  "goodreads_rating": string,\n  "reason": string,\n  "adaptations": string,\n  "page_count": number\n}\n```\n\nСтойностите на всички полета трябва да бъдат преведени на български език, освен ако оригиналното съдържание (например корицата или заглавието на английски) не изисква друго. Полето "real_edition_title" трябва да съдържа точния и пълен заглавие на изданието от Google Books, което ще бъде използвано за директно търсене.'
    },
    {
      role: "user",
      content:
        'Ето допълнителни указания, които трябва да следваш: \n1. Книгите трябва да са разнообразни по жанр (например класика, научна фантастика, романтика и др.).\n2. Включи адаптации на книги (ако има такива) като филми, сериали или театрални постановки, посочвайки имената на тези адаптации и годините на издаване/представяне.\n3. Погрижи се информацията да бъде актуална и точна.\n4. Преведи всички текстови стойности като заглавие, резюме, жанрове, държава и автор на български език.\n5. Винаги превеждай Великобритания като "Великобритания".\n6. Полето "date_of_first_issue" е годината, в която книгата е издадена за първи път, а "date_of_issue" е годината на това конкретно издание на книгата.'
    },
    {
      role: "user",
      content:
        'Отговори само с JSON обект без допълнителен текст или обяснения, който обхваща ВСИЧКИ препоръки ЗАЕДНО. Например: \n\n```\n{\n  "title_en": "To Kill a Mockingbird",\n  "title_bg": "Да убиеш присмехулник",\n  "real_edition_title": "To Kill a Mockingbird - Harper Lee - Google Books",\n  "author": "Харпър Лий",\n  "genres": ["Южен готик", "Билдунгсроман"],\n  "description": "Романът разказва историята на младата Скаут Финч в южната част на САЩ през 30-те години на XX век, докато тя и брат й Джем се сблъскват с расизъм, морал и справедливост, вдъхновени от баща си Атикус Финч, който защитава чернокож мъж, обвинен несправедливо в изнасилване на бяла жена.",\n  "edition_language": "Английски",\n  "language": "Английски",\n  "country": "САЩ",\n  "date_of_first_issue": 1960,\n  "date_of_issue": 1960,\n  "goodreads_rating": "4.27",\n  "reason": "Отговор на въпроса: Защо този филм/сериал е подходящ за мен?",\n  "adaptations": "Филмова адаптация от 1962 г. и сценична адаптация.",\n  "page_count": 281\n}\n```'
    }
  ]
};

export const goodreadsExampleResponse = `[
  {
      "title_en": "One of Us Is Lying",
      "title_bg": "Един от нас лъже",
      "real_edition_title": "One of Us Is Lying - Karen M. McManus - Goodreads",
      "origin": "Американска литература",
      "reason": "Книгата е с мистериозен сюжет и се фокусира върху дълбочинната разработка на героите, което отговаря на търсенето за бавна книга, идеална за тийнеджъри.",
      "adaptations": "Телевизионен сериал 'One of Us Is Lying', 2021"
  },
  {
      "title_en": "A Study in Charlotte",
      "title_bg": "Проучване върху Шарлот",
      "real_edition_title": "A Study in Charlotte - Brittany Cavallaro - Goodreads",
      "origin": "Американска литература",
      "reason": "Тази книга представя мистерия с развитие на героите и тийнеджърски акценти, което я прави подходяща за читатели, търсещи увлекателни личности и ясни сюжетни линии.",
      "adaptations": "Няма известни адаптации"
  },
  {
      "title_en": "Truly Devious",
      "title_bg": "Истински коварна",
      "real_edition_title": "Truly Devious - Maureen Johnson - Goodreads",
      "origin": "Американска литература",
      "reason": "Тази мистериозна книга е със средна степен на задълбочаване и основана на разгръщането на различни характери, подходяща за тийнеджъри, които обичат постепенното разкриване на историята.",
      "adaptations": "Няма известни адаптации"
  },
  {
      "title_en": "The Inheritance Games",
      "title_bg": "Игрите на наследството",
      "real_edition_title": "The Inheritance Games - Jennifer Lynn Barnes - Goodreads",
      "origin": "Американска литература",
      "reason": "Книгата предлага сложна мистерия, но е поднесена по начин, който е достъпен и разбираем за тийнеджери, със стабилно развитие на героите.",
      "adaptations": "Няма известни адаптации"
  },
  {
      "title_en": "We Were Liars",
      "title_bg": "Ние бяхме лъжци",
      "real_edition_title": "We Were Liars - E. Lockhart - Goodreads",
      "origin": "Американска литература",
      "reason": "Книгата е със среден ритъм и фокус върху взаимоотношенията между персонажите, представяйки дълбок мистериозен сюжет, подходящ за емоционално тъжни тийнеджъри.",
      "adaptations": "Адаптация в разработка"
  }
]`;
