export const metricConfig = {
  fpr: {
    title: "FPR",
    description: "Честота на неподходящи предложени препоръки (FP)",
    tooltip:
      "Измерва колко от всички НЕподходящи препоръки в системата всъщност са препоръчани на потребителя. Колкото по-ниска е стойността, толкова по-малко грешни препоръки прави моделът."
  },
  fnr: {
    title: "FNR",
    description: "Честота на подходящи пропуснати препоръки (FN)",
    tooltip:
      "Измерва колко от всички подходящи препоръки в системата всъщност НЕ са препоръчани на потребителя. Колкото по-висока е стойността, толкова повече подходящи (релевантни) препоръки моделът НЕ успява да препоръча."
  },
  specificity: {
    title: "Specificity",
    description: "Честота на неподходящи пропуснати препоръки (TN)",
    tooltip:
      "Измерва колко от всички НЕподходящи препоръки в системата всъщност НЕ са препоръчани на потребителя. Докато Recall (TPR) се фокусира върху това да даде представа доколко моделът пропуска релевантни препоръки (FN), Specificity (TNR) показва доколко добре моделът избягва да предлага нерелевантни препоръки (TN) – да не ги счита за релевантни."
  },
  accuracy: {
    title: "Accuracy",
    description: "Обща точност",
    tooltip:
      "Общата точност на модела отчита както верните положителни (TP), така и верните отрицателни (TN) предположения на ИИ. Както може ИИ да ни препоръча нещо, което е сметнал за подходящо и то наистина да е такова, така може и да ПРОПУСНЕ нещо, което в действителност НЕ Е подходящо за нас. Технически, ИИ пак е направил вярно предположение."
  }
};
