export const genreOptions = [
  { en: "Action", bg: "Екшън" },
  { en: "Adventure", bg: "Приключенски" },
  { en: "Animation", bg: "Анимация" },
  { en: "Biography", bg: "Биография" },
  { en: "Comedy", bg: "Комедия" },
  { en: "Crime", bg: "Криминален" },
  { en: "Documentary", bg: "Документален" },
  { en: "Drama", bg: "Драма" },
  { en: "Family", bg: "Семейни" },
  { en: "Fantasy", bg: "Фентъзи" },
  { en: "Film-Noir", bg: "Филм-ноар" },
  { en: "History", bg: "Исторически" },
  { en: "Horror", bg: "Ужаси" },
  { en: "Music", bg: "Музика" },
  { en: "Musical", bg: "Мюзикъл" },
  { en: "Mystery", bg: "Мистерия" },
  { en: "Romance", bg: "Романтичен" },
  { en: "Sci-Fi", bg: "Научна фантастика" },
  { en: "Sport", bg: "Спортен" },
  { en: "Thriller", bg: "Трилър" },
  { en: "War", bg: "Военен" },
  { en: "Western", bg: "Уестърн" }
];

export const moodOptions = [
  "Развълнуван/-на 😄",
  "Любопитен/-на 🤔",
  "Тъжен/-на 😢",
  "Щастлив/-а 😊",
  "Спокоен/-йна 😌",
  "Разочарован/-на 😞",
  "Уморен/-на 😴",
  "Нервен/-на 😟",
  "Разгневен/-на 😠",
  "Стресиран/-на 😰",
  "Носталгичен/-на 😭",
  "Безразличен/-на 😐",
  "Оптимистичен/-на 😃",
  "Песимистичен/-на 😔",
  "Весел/-а 😁",
  "Смутен/-на 😳",
  "Озадачен/-на 🤨",
  "Разтревожен/-на 😧",
  "Вдъхновен/-на ✨"
];

export const timeAvailabilityOptions = [
  "1 час",
  "2 часа",
  "3 часа",
  "Нямам предпочитания"
];

export const ageOptions = [
  "Публикуван в последната 1 година",
  "Публикуван в последните 3 години",
  "Публикуван в последните 5 години",
  "Публикуван в последните 10 години",
  "Публикуван в последните 20 години",
  "Нямам предпочитания"
];

export const pacingOptions = [
  "бавни, концентриращи се върху разкази на героите",
  "бързи с много напрежение",
  "Нямам предпочитания"
];
export const depthOptions = [
  "Лесни за проследяване - релаксиращи",
  "Средни - с ясни сюжетни линии",
  "Трудни - с много истории и терминологии, характерни за филма",
  "Нямам предпочитания"
];

export const targetGroupOptions = [
  "Деца",
  "Тийнейджъри",
  "Възрастни",
  "Семейни",
  "Семейство и деца",
  "Възрастни над 65"
];

export const openAIKey = import.meta.env.VITE_OPENAI_API_KEY;
